[
{
    "author" : "Derek",
    "title": "Learning to Code is Fun!",
    "urlToImage": "https://makeawebsitehub.com/wp-content/uploads/2016/02/learn-code-e1455713167295.jpg",
    "content": "In a stunning turn of events, I was able to get this working. \n This is the start of a new paragraph. ",
    "category": "None",
    "published": "6-8-2019"

},
{
    "author" : "Derek",
    "title": "Fireworks in D.C. Ahead of July 4th Fireworks",
    "urlToImage": "https://www.sandypines.com/wp-content/uploads/Fireworks-1-1200x801.jpg",
    "content": "Fireworks were set off in Washington D.C. on Monday as President Trump tweeted that he would ban avocado toast in what many critics are calling a step too far.",
    "category": "None",
    "published": "6-9-2019"
},
{
    "author" : "Derek",
    "title": "Why You Should Learn To Code",
    "urlToImage": "https://www.elegantthemes.com/blog/wp-content/uploads/2018/12/top11.png",
    "content": "Coding is a difficult and rewarding career path.",
    "category": "None",
    "published": "6-10-2019"
},
{
    "author" : "Derek",
    "title": "'COEXIST' Bumper Sticker Stops Suicide Bombing In Kabul",
    "urlToImage": "https://eaglewit.files.wordpress.com/2019/03/coexist.jpg",
    "content": "KABUL, AFGHANISTAN — On Friday morning, a suicide bombing attempt was stopped dead in its tracks by a “COEXIST” bumper sticker in streets of the capital city of Afghanistan.  A parked car sporting the trendy decal was seen by an ISIS fighter who caught a glimpse, ultimately reconsidering his behavior. /n /n
    Abdul Muhsin, a 10-year terrorist veteran, was seen quietly removing his suicide vest outside of the U.S. embassy after spotting the car.   Abdul waited for twenty minutes at the scene to thank the owner of the car for changing his life. /n /n
    Abdul later invited the owner of the car, Muhammad Shaheed, to join him for an iced latte to discuss how diplomacy can be used to bring people together. /n /n
    “I was going down a dark path.  Now that I look back at it, I can’t believe what a monster I had become,” said Abdul of the reformation. /n /n
    In light of the event, security forces outside of the U.S. Embassy in Kabul have ramped up security measures by ordering thousands of coexist bumper stickers today.  The hope is that the stickers will continue to deter violence, acting as yet another layer of security in the war torn nation. /n /n
    US Army Col. James Hoover said, “we hope to saturate the streets of Kabul with these bumper stickers.  Ultimately, we need to have one on every car if we hope to keep this violence at bay.  Deterrence is half the battle.”
    ",
    "category": "Military",
    "published": "6-11-2019"
}

]

